{
  "user_skill_level": "Beginner",
  "general_summary": "Overall, your form shows potential, but there are some critical areas to address for safety and effectiveness. Specifically, focus on maintaining a neutral spine during your push-ups and ensuring your elbows remain tucked to protect your shoulders. One rep demonstrated excellent depth and control, showing you can achieve good form with conscious effort. Keep practicing these adjustments to build a strong foundation.",
  "timeline_events": [
    {
      "start_time": 2.0,
      "end_time": 3.5,
      "overlay_text": "Keep back straight!",
      "detailed_explanation": "Your lower back sagged significantly, creating excessive lumbar extension. This puts unnecessary stress on your spine and can lead to discomfort or injury. Focus on keeping your core engaged throughout the movement.",
      "correction_cue": "Actively brace your core and engage your glutes to keep your hips in line with your shoulders throughout the movement.",
      "status_color": "red"
    },
    {
      "start_time": 5.0,
      "end_time": 6.5,
      "overlay_text": "Excellent form, great depth!",
      "detailed_explanation": "You achieved excellent depth while maintaining a neutral spine, indicating strong core engagement and good range of motion. This was a well-executed repetition!",
      "correction_cue": "Continue to focus on controlled movement and maintaining your strong spinal alignment.",
      "status_color": "green"
    },
    {
      "start_time": 8.0,
      "end_time": 9.5,
      "overlay_text": "Tuck elbows in!",
      "detailed_explanation": "Your elbows flared out excessively, reaching 90 degrees from your torso. This position places significant stress on your shoulder joints and can increase your risk of injury. Aim to keep your elbows closer to your body.",
      "correction_cue": "Actively pull your elbows back and down towards your hips, aiming for a 45-degree angle relative to your torso to protect your shoulders.",
      "status_color": "red"
    }
  ]
}