{
  "user_skill_level": "Beginner",
  "general_summary": "You show good potential with moments of excellent form, but there are some critical areas to focus on for safety and effectiveness. Prioritize maintaining a straight back and proper elbow position to prevent injury and maximize muscle engagement.",
  "timeline_events": [
    {
      "start_time": 2.0,
      "end_time": 3.5,
      "overlay_text": "Keep back straight!",
      "detailed_explanation": "During this rep, your lower back sagged significantly below the shoulder line. This common mistake can put unwanted stress on your lumbar spine. Maintaining a neutral spine is crucial for safety and effective muscle activation in a push-up.",
      "correction_cue": "Engage your core by bracing your abs and squeeze your glutes to maintain a straight line from your head to your heels throughout the entire movement.",
      "status_color": "red"
    },
    {
      "start_time": 5.0,
      "end_time": 6.5,
      "overlay_text": "Great depth!",
      "detailed_explanation": "Fantastic job on this push-up! You achieved excellent depth, bringing your chest close to the floor, while maintaining a neutral spine. This demonstrates great control and proper form. Keep up this consistency!",
      "correction_cue": "Continue to focus on a controlled descent and ascent, ensuring your body stays in a rigid, straight line from head to heels as you did here.",
      "status_color": "green"
    },
    {
      "start_time": 8.0,
      "end_time": 9.5,
      "overlay_text": "Tuck elbows in!",
      "detailed_explanation": "Your elbows flared out significantly, almost perpendicular to your torso, during this rep. Flared elbows place undue stress on your shoulder joints and can lead to discomfort or injury. Bringing your elbows closer to your body will protect your shoulders.",
      "correction_cue": "As you lower your body, keep your elbows tucked in at approximately a 45-degree angle relative to your torso. Imagine them pointing slightly backward, not directly out to the sides.",
      "status_color": "red"
    }
  ]
}